app/views/sessions/show.html.erb

	<tbody>
	<% @session.seances.each do |s| -%>
---
SELECT "seances".* FROM "seances" WHERE ("seances".session_id = 8)

			<% i = 1 %>
			<% s.texts.each do |t| -%>
---
SELECT "texts".* FROM "texts" WHERE ("texts".seance_id = 114)