app/views/seances/index.html.erb

		<% i = 1 %>
		<% seance.texts.each do |t| -%>
---
SELECT "texts".* FROM "texts" WHERE ("texts".seance_id = 114)