app/views/seances/show.html.erb

SELECT "texts".* FROM "texts" WHERE ("texts".seance_id = 101)
---
	<tbody>
	<% @seance.texts.each do |t| -%>

SELECT "votes".* FROM "votes" WHERE ("votes".text_id = 368)
---
		<td><%= t.title %></td>
		<td style=" padding-left: 10px;"><img src="http://chart.apis.google.com/chart?cht=bhs&chs=150x23&chd=t:<%= "#{t.votes_pour.count}|#{t.votes_contre.count}|#{t.abstentions.count}" %>&chds=0,60&chco=<%= "#{vote_to_color_simple(1)},#{vote_to_color_simple(-1)},#{vote_to_color_simple(0)}" %>" /><br />