app/views/deputies/show.html.erb

		<td><%= v.delegate.name %></td>
		<% z = Vote.find_by_text_id_and_deputy_id(v.text_id, v.delegate_id) -%>
---
SELECT "votes".* FROM "votes" WHERE ("votes"."text_id" = 373) AND ("votes"."deputy_id" = 457) LIMIT 1