app/views/deputies/show.html.erb

SELECT "texts".* FROM "texts" WHERE ("texts"."id" = 437) LIMIT 1
---
			<% @deputy.votes.each do |v| -%>
			<% if !v.text.featured.nil? && !v.text.featured.empty? then %>