app/controllers/deputies_controller.rb

SELECT "deputies".* FROM "deputies" ORDER BY name ASC
---
  def index
    @deputies = Deputy.all(:order => "lastname ASC")

SELECT "deputies".* FROM "deputies" WHERE ("deputies"."id" = 455) LIMIT 1
SELECT "votes".* FROM "votes" WHERE ("votes".deputy_id = 455)
---
  def show
    @deputy = Deputy.find(params[:id], :include => :votes)