app/controllers/seances_controller.rb

SELECT "seances".* FROM "seances"
---
  def index
    @seances = Seance.all

SELECT "seances".* FROM "seances" WHERE ("seances"."id" = 101) LIMIT 1
---
  def show
    @seance = Seance.find(params[:id])