app/controllers/texts_controller.rb

SELECT "texts".* FROM "texts"
---
  def index
    @texts = Text.all

SELECT "texts".* FROM "texts" WHERE ("texts"."id" = 362) LIMIT 1
---
  def show
    @text = Text.find(params[:id])